#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with module.cdn.aws_s3_bucket.origin,
  on .terraform/modules/cdn/main.tf line 259, in resource "aws_s3_bucket" "origin":
 259:   acl           = "private"

Use the aws_s3_bucket_acl resource instead
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cdn.module.logs.data.aws_partition.current: Reading...
module.cdn.aws_cloudfront_origin_access_identity.default[0]: Refreshing state... [id=E3OEDWFE328RRQ]
data.aws_route53_zone.this: Reading...
module.cdn.data.aws_partition.current[0]: Reading...
data.aws_s3_bucket.this: Reading...
module.cdn.data.aws_region.current[0]: Reading...
data.aws_acm_certificate.this: Reading...
module.cdn.module.logs.data.aws_caller_identity.current: Reading...
module.cdn.module.logs.aws_s3_bucket.default[0]: Refreshing state... [id=kq4afy-use1-cdn-logs]
module.cdn.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.cdn.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.cdn.module.logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.cdn.module.logs.data.aws_caller_identity.current: Read complete after 0s [id=072105303426]
data.aws_s3_bucket.this: Read complete after 0s [id=kq4afy.xyz]
module.cdn.data.aws_s3_bucket.origin[0]: Reading...
module.cdn.data.aws_s3_bucket.origin[0]: Read complete after 0s [id=kq4afy.xyz]
module.cdn.module.logs.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=kq4afy-use1-cdn-logs]
module.cdn.module.logs.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.cdn.module.logs.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=12357417]
module.cdn.module.logs.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.cdn.module.logs.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=1295613764]
module.cdn.module.logs.aws_s3_bucket_policy.default[0]: Refreshing state... [id=kq4afy-use1-cdn-logs]
data.aws_acm_certificate.this: Read complete after 0s [id=arn:aws:acm:us-east-1:072105303426:certificate/b89f103c-57a2-4aa5-bd9c-bfed2eb09df0]
module.cdn.module.logs.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2022-12-08T19:04:45Z]
module.cdn.module.logs.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=kq4afy-use1-cdn-logs]
data.aws_route53_zone.this: Read complete after 0s [id=Z048504419NDW43VP1NZI]
module.cdn.module.dns.data.aws_route53_zone.default[0]: Reading...
module.cdn.data.aws_iam_policy_document.s3_ssl_only[0]: Reading...
module.cdn.aws_cloudfront_distribution.default[0]: Refreshing state... [id=E24XCU50JVWOD5]
module.cdn.data.aws_iam_policy_document.s3_ssl_only[0]: Read complete after 0s [id=2782688795]
module.cdn.aws_s3_bucket_policy.default[0]: Refreshing state... [id=kq4afy.xyz]
module.cdn.module.dns.data.aws_route53_zone.default[0]: Read complete after 1s [id=Z048504419NDW43VP1NZI]
module.cdn.module.dns.aws_route53_record.default["kq4afy.xyz"]: Refreshing state... [id=Z048504419NDW43VP1NZI_kq4afy.xyz_A]
module.cdn.module.dns.aws_route53_record.ipv6["kq4afy.xyz"]: Refreshing state... [id=Z048504419NDW43VP1NZI_kq4afy.xyz_AAAA]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.cdn.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.cdn.data.aws_iam_policy_document.s3_website_origin[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_website_origin" {
      + id            = (known after apply)
      + json          = (known after apply)
      + override_json = jsonencode({})

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::kq4afy.xyz/*",
            ]
          + sid       = "S3GetObjectForCloudFront"

          + condition {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.cdn.aws_cloudfront_distribution.default[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "default" {
        id                             = "E24XCU50JVWOD5"
        tags                           = {
            "Name"      = "kq4afy-use1-cdn"
            "Namespace" = "kq4afy"
            "Stage"     = "use1"
        }
        # (20 unchanged attributes hidden)

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "kq4afy.xyz.s3.amazonaws.com" -> null
          - origin_id           = "kq4afy-use1-cdn" -> null

          - s3_origin_config {
              - origin_access_identity = "origin-access-identity/cloudfront/E3OEDWFE328RRQ" -> null
            }
        }
      + origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (5 unchanged blocks hidden)
    }

  # module.cdn.aws_s3_bucket_policy.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "default" {
        id     = "kq4afy.xyz"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E3OEDWFE328RRQ"
                        }
                      - Resource  = "arn:aws:s3:::kq4afy.xyz/*"
                      - Sid       = "S3GetObjectForCloudFront"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E3OEDWFE328RRQ"
                        }
                      - Resource  = "arn:aws:s3:::kq4afy.xyz"
                      - Sid       = "S3ListBucketForCloudFront"
                    },
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::kq4afy.xyz/*",
                          - "arn:aws:s3:::kq4afy.xyz",
                        ]
                      - Sid       = "ForceSSLOnlyAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.cdn.random_password.referer[0] will be created
  + resource "random_password" "referer" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cdn.module.logs.aws_s3_bucket.default[0],
  on .terraform/modules/cdn.logs/main.tf line 1, in resource "aws_s3_bucket" "default":
   1: resource "aws_s3_bucket" "default" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jbouse, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*